tutorials/fluidSolidInteraction/fillingElasticContainer/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     solids4Foam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          1e-3;

writeControl    runTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  no;

maxCo           0.5;

maxAlphaCo      0.5;

maxDeltaT       1;

functions
{
    disp
    {
        type    solidPointDisplacement;
        point   (0 -6.0 0);
    }
    waterVolume
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        region          fluid;
        fields          (alpha.water);
        operation       volIntegrate;
        regionType      all;
        writeFields     no;
        writeControl    timeStep;
	writeInterval   1;
        log             yes;
    }
}

// ************************************************************************* //
