tutorials/fluidSolidInteraction/fillingElasticContainer/system/fluid/blockMeshDict.1
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    // back
    (-4.22 5 0)
    (4.22 5 0)

    (-2.25 0 0)
    (-0.65 0 0)
    (0.65 0 0)
    (2.25 0 0)

    (-2.25 -3.75 0)
    (-0.65 -3.75 0)
    (0.65 -3.75 0)
    (2.25 -3.75 0)

    (-1.5909902577 -5.3409902577 0)
    (-0.65 -4.5454951288 0)
    (0.65 -4.5454951288 0)
    (1.5909902577 -5.3409902577 0)

    // front
    (-4.22 5 0.1)
    (4.22 5 0.1)

    (-2.25 0 0.1)
    (-0.65 0 0.1)
    (0.65 0 0.1)
    (2.25 0 0.1)

    (-2.25 -3.75 0.1)
    (-0.65 -3.75 0.1)
    (0.65 -3.75 0.1)
    (2.25 -3.75 0.1)

    (-1.5909902577 -5.3409902577 0.1)
    (-0.65 -4.5454951288 0.1)
    (0.65 -4.5454951288 0.1)
    (1.5909902577 -5.3409902577 0.1)
);

blocks
(
    hex (3 4 1 0 17 18 15 14) (20 30 1) simpleGrading (1 1 1)

    hex (6 7 3 2 20 21 17 16) (10 20 1) simpleGrading (1 1 1)
    hex (7 8 4 3 21 22 18 17) (20 20 1) simpleGrading (1 1 1)
    hex (8 9 5 4 22 23 19 18) (10 20 1) simpleGrading (1 1 1)

    hex (10 11 7 6 24 25 21 20) (10 10 1) simpleGrading (1 1 1)
    hex (10 13 12 11 24 27 26 25) (20 10 1) simpleGrading (1 1 1)
    hex (11 12 8 7 25 26 22 21) (20 10 1) simpleGrading (1 1 1)
    hex (12 13 9 8 26 27 23 22) (10 10 1) simpleGrading (1 1 1)
);

edges
(
    // left
    arc 6 10 (-2.07872894815 -4.6110377228 0)
    arc 20 24 (-2.07872894815 -4.6110377228 0.1)

    // centre
    arc 10 13 (0 -6 0)
    arc 24 27 (0 -6 0.1)

    // right
    arc 13 9 (2.07872894815 -4.6110377228 0)
    arc 27 23 (2.07872894815 -4.6110377228 0.1)
);

boundary
(
    interface
    {
        type wall;
        faces
        (
            (2 6 20 16)
            (6 10 24 20)
            (10 13 27 24)
            (13 9 23 27)
            (9 5 19 23)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 3 17 14)
            // (3 2 16 17)
            // (5 4 18 19)
            (4 1 15 18)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (1 0 14 15)
            (3 2 16 17)
            (5 4 18 19)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
